[
  {
  "messageBody": "Hey, I saw on your profile that you enjoy golfing! What's your favorite course to play at?"
  },
  {
  "messageBody": "Hi there, I couldn't help but notice your interest in romance novels. Do you have any favorites that you would recommend?"
  },
  {
  "messageBody": "Hello, I'm new to the area and was wondering if you had any recommendations for a good place to golf around here?"
  },
  {
  "messageBody": "Hey, I'm trying to get more into golfing and was wondering if you had any tips for a beginner?"
  },
  {
  "messageBody": "Hi, I see that you enjoy reading romance novels! What do you think of the 'Outlander' series?"
  },
  {
  "messageBody": "Hello, I'm looking for a new golf buddy. Would you be interested in playing a round sometime?"
  },
  {
  "messageBody": "Hey there, I'm curious - do you prefer playing on public or private golf courses?"
  },
  {
  "messageBody": "Hey, I noticed we both enjoy hiking. Have you been to any great trails lately?"
  },
  {
  "messageBody": "Hi, I see you're a fan of cooking. What's your go-to recipe when you're in the mood for something comforting?"
  },
  {
  "messageBody": "Hello, I'm new to the city and I'm wondering if you have any recommendations for a good place to grab a drink?"
  },
  {
  "messageBody": "Hey, I see you enjoy running. Do you have any tips for staying motivated during a long race?"
  },
  {
  "messageBody": "Hi there, I'm trying to get more into yoga. Do you have any favorite online classes you would recommend?"
  },
  {
  "messageBody": "Hello, I see you're interested in history. What's your favorite time period to learn about?"
  },
  {
  "messageBody": "Hey, I noticed we both enjoy photography. What's your favorite subject to shoot?"
  },
  {
  "messageBody": "Hi, I see you're a fan of music. What's your favorite concert you've ever been to?"
  },
  {
  "messageBody": "Hello, I'm trying to get more into meditation. Do you have any tips for beginners?"
  },
  {
  "messageBody": "Hey there, I see you enjoy painting. What's your favorite medium to work with?"
  },
  {
  "messageBody": "Hi there, I noticed we both love animals. Do you have any pets of your own?"
  },
  {
  "messageBody": "Hello, I'm new to town and I'm wondering if you have any favorite restaurants in the area?"
  },
  {
  "messageBody": "Hey, I see you enjoy travel. What's the most adventurous trip you've ever been on?"
  },
  {
  "messageBody": "Hi, I see you're interested in astrology. What's your zodiac sign and do you think it accurately represents you?"
  },
  {
  "messageBody": "Hello, I'm trying to get more into painting. Do you have any tips for beginners?"
  },
  {
  "messageBody": "Hey there, I noticed we both enjoy watching movies. What's your favorite movie of all time?"
  },
  {
  "messageBody": "Hi, I see you're a fan of sports. What's your favorite team and why?"
  },
  {
  "messageBody": "Hello, I'm new to the gym and I'm wondering if you have any tips for getting in shape?"
  },
  {
  "messageBody": "Hey, I see you enjoy cooking. What's your go-to recipe when you're in the mood for something spicy?"
  },
  {
  "messageBody": "Hi there, I noticed we both enjoy reading. What's your favorite book and why?"
  }
]